// Задача 1:
// Напишите функцию, которая принимает массив чисел и возвращает новый массив, состоящий из квадратов элементов исходного массива.
// [1, 2, 3, 4]

// Решение:
const const1 = [1, 2, 3, 4];

const numberMathSqrt = const1.map(Math.sqrt);
console.log(numberMathSqrt);
//---------------------------------------------------------------------------------------------------------------------------------------

// Задача 2:
// Напишите функцию, которая принимает массив чисел и возвращает сумму элементов этого массива.
// [1, 2, 3, 4, 5]

// Решение:
let numberAll = [1, 2, 3, 4, 5]; //15

        function numberSum(numberAll) {
                return numberAll.reduce((total, n) => total + n)
        }
        console.log(numberSum(numberAll))
//----------------------------------------------------------------------------------------------------------------------------------------

// Задача 3:
// Напишите функцию, которая принимает массив чисел и возвращает новый массив, состоящий из элементов исходного массива в обратном порядке.

// Решение: 
const composition = [1, 2, 3, 4, 5]
        const sortResult = [];

                composition.sort((a,b) => b - a);
                
                for (let index = 0; index < composition.length; index++) {
                        const element = composition[index];
                        
                        sortResult.push(composition[index])
                }

                console.log(sortResult);
//------------------------------------------------------------------------------------------------------------------------------------------
